""" Перечень переменных
        Имя пользователя
        Название
        Описание
        Статус
        Дата создания
        Дата истекания
"""

username = "Александр Ромилов"
title = "Встреча с заказчиком"
content = "Встреча пройдёт в кафе 'Савана' на ул.Ленина 30 "
status = "Активна"
created_date = "21.12.24"
issue_date = "12.01.25"

print("Имя пользователя:", username)
print("Заголовок заметки:", title)
print("Описание заметки:", content)
print("Статус заметки:", status)
print("Дата создания:", created_date)
print("Дата истечения заметки:", issue_date)